balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18LF46J13.PIC
      <edc:DCRDef edc:access="nnnnnnnn" edc:cname="CONFIG3L" edc:default="0xff" edc:desc="" edc:impl="0xff" edc:name="CONFIG3L" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xff">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="DSWDTOSC" edc:desc="DSWDT Clock Select" edc:mask="0x1" edc:name="DSWDTOSC" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="INTOSCREF" edc:desc="DSWDT uses INTRC" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="T1OSCREF" edc:desc="DSWDT uses T1OSC/T1CKI" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="RTCOSC" edc:desc="RTCC Clock Select" edc:mask="0x1" edc:name="RTCOSC" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="T1OSCREF" edc:desc="RTCC uses T1OSC/T1CKI" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="INTOSCREF" edc:desc="RTCC uses INTRC" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="DSBOREN" edc:desc="Deep Sleep BOR" edc:mask="0x1" edc:name="DSBOREN" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="DSWDTEN" edc:desc="Deep Sleep Watchdog Timer" edc:mask="0x1" edc:name="DSWDTEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="DSWDTPS" edc:desc="Deep Sleep Watchdog Postscaler" edc:mask="0xf" edc:name="DSWDTPS" edc:nzwidth="4">
              <edc:DCRFieldSemantic edc:cname="G2" edc:desc="1:2,147,483,648 (25.7 days)" edc:when="(field &amp; 0xf) == 0xf"/>
              <edc:DCRFieldSemantic edc:cname="M536" edc:desc="1:536,870,912 (6.4 days)" edc:when="(field &amp; 0xf) == 0xe"/>
              <edc:DCRFieldSemantic edc:cname="M134" edc:desc="1:134,217,728 (38.5 hours)" edc:when="(field &amp; 0xf) == 0xd"/>
              <edc:DCRFieldSemantic edc:cname="M33" edc:desc="1:33,554,432 (9.6 hours)" edc:when="(field &amp; 0xf) == 0xc"/>
              <edc:DCRFieldSemantic edc:cname="M8" edc:desc="1:8,388,608 (2.4 hours)" edc:when="(field &amp; 0xf) == 0xb"/>
              <edc:DCRFieldSemantic edc:cname="M2" edc:desc="1:2,097,152 (36 minutes)" edc:when="(field &amp; 0xf) == 0xa"/>
              <edc:DCRFieldSemantic edc:cname="K524" edc:desc="1:524,288 (9 minutes)" edc:when="(field &amp; 0xf) == 0x9"/>
              <edc:DCRFieldSemantic edc:cname="K131" edc:desc="1:131,072 (135 seconds)" edc:when="(field &amp; 0xf) == 0x8"/>
              <edc:DCRFieldSemantic edc:cname="K32" edc:desc="1:32,768 (34 seconds)" edc:when="(field &amp; 0xf) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="8192" edc:desc="1:8,192 (8.5 seconds)" edc:when="(field &amp; 0xf) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="2048" edc:desc="1:2,048 (2.1 seconds)" edc:when="(field &amp; 0xf) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="512" edc:desc="1:512 (528 ms)" edc:when="(field &amp; 0xf) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="128" edc:desc="1:128 (132 ms)" edc:when="(field &amp; 0xf) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="32" edc:desc="1:32 (33 ms)" edc:when="(field &amp; 0xf) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="8" edc:desc="1:8 (8.3 ms)" edc:when="(field &amp; 0xf) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="2" edc:desc="1:2 (2.1 ms)" edc:when="(field &amp; 0xf) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="----nnnn" edc:cname="CONFIG3H" edc:default="0xff" edc:desc="" edc:impl="0xf" edc:name="CONFIG3H" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xff">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="IOL1WAY" edc:desc="IOLOCK One-Way Set Enable bit" edc:mask="0x1" edc:name="IOL1WAY" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="The IOLOCK bit (PPSCON&lt;0&gt;) can be set once" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="The IOLOCK bit (PPSCON&lt;0&gt;) can be set and cleared as needed" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="ADCSEL" edc:desc="ADC 10 or 12 Bit Select" edc:mask="0x1" edc:name="ADCSEL" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="BIT10" edc:desc="10 - Bit ADC Enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="BIT12" edc:desc="12 - Bit ADC Enabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="PLLSEL" edc:desc="PLL Selection Bit" edc:mask="0x1" edc:name="PLLSEL" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="PLL96" edc:desc="Selects 96MHz PLL" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="PLL4X" edc:desc="Selects 4x PLL" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="MSSP7B_EN" edc:desc="MSSP address masking" edc:mask="0x1" edc:name="MSSP7B_EN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="MSK7" edc:desc="7 Bit address masking mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="MSK5" edc:desc="5 Bit address masking mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="RESERVED" edc:desc="RESERVED" edc:ishidden="true" edc:mask="0xf" edc:name="RESERVED" edc:nzwidth="0x4">
              <edc:DCRFieldSemantic edc:cname="RESERVED" edc:desc="RESERVED" edc:when="(field &amp; 0xf) == 0xf"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="n-nnnnnn" edc:cname="CONFIG4L" edc:default="0xbf" edc:desc="" edc:impl="0xbf" edc:name="CONFIG4L" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xff">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="WPFP" edc:desc="Write/Erase Protect Page Start/End Location" edc:mask="0x3f" edc:name="WPFP" edc:nzwidth="6">
              <edc:DCRFieldSemantic edc:cname="PAGE_0" edc:desc="Write Protect Program Flash Page 0" edc:when="(field &amp; 0x3f) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_1" edc:desc="Write Protect Program Flash Page 1" edc:when="(field &amp; 0x3f) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_2" edc:desc="Write Protect Program Flash Page 2" edc:when="(field &amp; 0x3f) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_3" edc:desc="Write Protect Program Flash Page 3" edc:when="(field &amp; 0x3f) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_4" edc:desc="Write Protect Program Flash Page 4" edc:when="(field &amp; 0x3f) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_5" edc:desc="Write Protect Program Flash Page 5" edc:when="(field &amp; 0x3f) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_6" edc:desc="Write Protect Program Flash Page 6" edc:when="(field &amp; 0x3f) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_7" edc:desc="Write Protect Program Flash Page 7" edc:when="(field &amp; 0x3f) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_8" edc:desc="Write Protect Program Flash Page 8" edc:when="(field &amp; 0x3f) == 0x8"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_9" edc:desc="Write Protect Program Flash Page 9" edc:when="(field &amp; 0x3f) == 0x9"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_10" edc:desc="Write Protect Program Flash Page 10" edc:when="(field &amp; 0x3f) == 0xa"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_11" edc:desc="Write Protect Program Flash Page 11" edc:when="(field &amp; 0x3f) == 0xb"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_12" edc:desc="Write Protect Program Flash Page 12" edc:when="(field &amp; 0x3f) == 0xc"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_13" edc:desc="Write Protect Program Flash Page 13" edc:when="(field &amp; 0x3f) == 0xd"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_14" edc:desc="Write Protect Program Flash Page 14" edc:when="(field &amp; 0x3f) == 0xe"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_15" edc:desc="Write Protect Program Flash Page 15" edc:when="(field &amp; 0x3f) == 0xf"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_16" edc:desc="Write Protect Program Flash Page 16" edc:when="(field &amp; 0x3f) == 0x10"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_17" edc:desc="Write Protect Program Flash Page 17" edc:when="(field &amp; 0x3f) == 0x11"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_18" edc:desc="Write Protect Program Flash Page 18" edc:when="(field &amp; 0x3f) == 0x12"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_19" edc:desc="Write Protect Program Flash Page 19" edc:when="(field &amp; 0x3f) == 0x13"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_20" edc:desc="Write Protect Program Flash Page 20" edc:when="(field &amp; 0x3f) == 0x14"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_21" edc:desc="Write Protect Program Flash Page 21" edc:when="(field &amp; 0x3f) == 0x15"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_22" edc:desc="Write Protect Program Flash Page 22" edc:when="(field &amp; 0x3f) == 0x16"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_23" edc:desc="Write Protect Program Flash Page 23" edc:when="(field &amp; 0x3f) == 0x17"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_24" edc:desc="Write Protect Program Flash Page 24" edc:when="(field &amp; 0x3f) == 0x18"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_25" edc:desc="Write Protect Program Flash Page 25" edc:when="(field &amp; 0x3f) == 0x19"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_26" edc:desc="Write Protect Program Flash Page 26" edc:when="(field &amp; 0x3f) == 0x1a"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_27" edc:desc="Write Protect Program Flash Page 27" edc:when="(field &amp; 0x3f) == 0x1b"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_28" edc:desc="Write Protect Program Flash Page 28" edc:when="(field &amp; 0x3f) == 0x1c"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_29" edc:desc="Write Protect Program Flash Page 29" edc:when="(field &amp; 0x3f) == 0x1d"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_30" edc:desc="Write Protect Program Flash Page 30" edc:when="(field &amp; 0x3f) == 0x1e"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_31" edc:desc="Write Protect Program Flash Page 31" edc:when="(field &amp; 0x3f) == 0x1f"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_32" edc:desc="Write Protect Program Flash Page 32" edc:when="(field &amp; 0x3f) == 0x20"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_33" edc:desc="Write Protect Program Flash Page 33" edc:when="(field &amp; 0x3f) == 0x21"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_34" edc:desc="Write Protect Program Flash Page 34" edc:when="(field &amp; 0x3f) == 0x22"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_35" edc:desc="Write Protect Program Flash Page 35" edc:when="(field &amp; 0x3f) == 0x23"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_36" edc:desc="Write Protect Program Flash Page 36" edc:when="(field &amp; 0x3f) == 0x24"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_37" edc:desc="Write Protect Program Flash Page 37" edc:when="(field &amp; 0x3f) == 0x25"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_38" edc:desc="Write Protect Program Flash Page 38" edc:when="(field &amp; 0x3f) == 0x26"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_39" edc:desc="Write Protect Program Flash Page 39" edc:when="(field &amp; 0x3f) == 0x27"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_40" edc:desc="Write Protect Program Flash Page 40" edc:when="(field &amp; 0x3f) == 0x28"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_41" edc:desc="Write Protect Program Flash Page 41" edc:when="(field &amp; 0x3f) == 0x29"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_42" edc:desc="Write Protect Program Flash Page 42" edc:when="(field &amp; 0x3f) == 0x2a"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_43" edc:desc="Write Protect Program Flash Page 43" edc:when="(field &amp; 0x3f) == 0x2b"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_44" edc:desc="Write Protect Program Flash Page 44" edc:when="(field &amp; 0x3f) == 0x2c"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_45" edc:desc="Write Protect Program Flash Page 45" edc:when="(field &amp; 0x3f) == 0x2d"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_46" edc:desc="Write Protect Program Flash Page 46" edc:when="(field &amp; 0x3f) == 0x2e"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_47" edc:desc="Write Protect Program Flash Page 47" edc:when="(field &amp; 0x3f) == 0x2f"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_48" edc:desc="Write Protect Program Flash Page 48" edc:when="(field &amp; 0x3f) == 0x30"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_49" edc:desc="Write Protect Program Flash Page 49" edc:when="(field &amp; 0x3f) == 0x31"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_50" edc:desc="Write Protect Program Flash Page 50" edc:when="(field &amp; 0x3f) == 0x32"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_51" edc:desc="Write Protect Program Flash Page 51" edc:when="(field &amp; 0x3f) == 0x33"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_52" edc:desc="Write Protect Program Flash Page 52" edc:when="(field &amp; 0x3f) == 0x34"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_53" edc:desc="Write Protect Program Flash Page 53" edc:when="(field &amp; 0x3f) == 0x35"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_54" edc:desc="Write Protect Program Flash Page 54" edc:when="(field &amp; 0x3f) == 0x36"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_55" edc:desc="Write Protect Program Flash Page 55" edc:when="(field &amp; 0x3f) == 0x37"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_56" edc:desc="Write Protect Program Flash Page 56" edc:when="(field &amp; 0x3f) == 0x38"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_57" edc:desc="Write Protect Program Flash Page 57" edc:when="(field &amp; 0x3f) == 0x39"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_58" edc:desc="Write Protect Program Flash Page 58" edc:when="(field &amp; 0x3f) == 0x3a"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_59" edc:desc="Write Protect Program Flash Page 59" edc:when="(field &amp; 0x3f) == 0x3b"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_60" edc:desc="Write Protect Program Flash Page 60" edc:when="(field &amp; 0x3f) == 0x3c"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_61" edc:desc="Write Protect Program Flash Page 61" edc:when="(field &amp; 0x3f) == 0x3d"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_62" edc:desc="Write Protect Program Flash Page 62" edc:when="(field &amp; 0x3f) == 0x3e"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_63" edc:desc="Write Protect Program Flash Page 63" edc:when="(field &amp; 0x3f) == 0x3f"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="RESERVED" edc:desc="" edc:ishidden="true" edc:mask="0x1" edc:name="RESERVED" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:desc="RESERVED" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WPCFG" edc:desc="Write/Erase Protect Configuration Region " edc:mask="0x1" edc:name="WPCFG" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Configuration Words page not erase/write-protected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Configuration Words page erase/write-protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
